Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: བལྟ་ན་སྡུག་པ། ཤིན་ཏུ་འགེལ་བ། འཕང་དུ་ཤིང་ཏ་ལ་བདུན་སྲིད་ཙམ་དུ་མཐོ་བ། དེ་དང་འཚམ་པར་འགེལ་བ། བཀྲ་བ། བལྟ་ན་སྡུག་པ། ཡིད་དུ་འོང་བ། རིན་པོ་ཆེ་སྣ་བདུན་གྱི་སྟེགས་བུ་རིམ་བདུན་གྱིས་བསྐོར་བ།
en: It was beautiful, nice to behold, wide, and, with its height of eighty palm trees and a corresponding circumference, very imposing. This was indeed a magnificent and beautiful tree. It was encircled by jewel platforms that were built in seven rows.

source: རིན་པོ་ཆེའི་ཤིང་ཏ་ལའི་ཕྲེང་བ་རིམ་པ་བདུན་དང་། རིན་པོ་ཆེའི་དྲིལ་བུ་གཡེར་ཀའི་དྲ་བ་རིམ་པ་བདུན་དང་། རིན་པོ་ཆེ་བརྒྱུས་པའི་ཕྲེང་བ་རིམ་པ་བདུན་གྱིས་ཀུན་ནས་བསྐོར་ཅིང་ཕྱི་རིམ་བསྐོར་བ།
en: Jewel palm trees were also placed around it in seven circles, and a sevenfold lattice with bells of precious stones enfolded it. All of this was surrounded with seven threads made of precious materials that formed the outer ring.

source: ཤིང་ཡོངས་འདུ་ས་བརྟོལ་དང་འདྲ་བ། མིག་གིས་བལྟ་བས་མི་ངོམས་པ་བསྐྱེད་དོ།
en: Like the coral tree or the kovidāra tree, this was a tree that one could never tire of beholding.

source: །གང་དུ་བྱང་ཆུབ་སེམས་དཔའ་འདུག་ནས་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་འདོད་པའི་ས་ཕྱོགས་དེ་ནི་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡོ་རྗེའི་དཀྱིལ་ཏེ། སྲ་བ། སྙིང་པོ་ཡོད་པ། མི་ཕྱེད་པ། རྡོ་རྗེའི་རང་བཞིན་དུ་གནས་པར་གྱུར་པའོ།
en: This place, where the Bodhisattva was to take his seat with the intention of attaining full and complete awakening, had become the essence of indestructible diamond, harder than any diamond in the great trichiliocosm.

source: །དགེ་སློང་དག་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་འགྲོ་བ་ན་ལུས་ལས་རྣམ་པ་འདི་ལྟ་བུའི་འོད་འགྱེད་དེ།
en: Monks, as the Bodhisattva was walking toward the seat of awakening, rays of light streamed forth from his body.

source: འོད་དེས་ངན་སོང་ཐམས་ཅད་ཞི་བར་གྱུར་ཏོ། །མི་ཁོམ་པ་ཐམས་ཅད་བཅད་པར་གྱུར་ཏོ།
en: The light pacified all the lower realms and caused all unfortunate states to cease.

source: །ངན་འགྲོའི་ཚོར་བ་ཐམས་ཅད་བསྐམས་པར་གྱུར་ཏོ།
en: All the painful feelings of beings in the lower realms came to a halt.

source: །སེམས་ཅན་གང་དག་དབང་པོ་མ་ཚང་བ་དེ་དག་ནི་དབང་པོ་ཡོངས་སུ་རྫོགས་པ་ཐོབ་པར་གྱུར་ཏོ།
en: All beings with impaired faculties now recovered their senses.

source: །ནད་ཀྱིས་བཏབ་པ་རྣམས་ནི་ནད་སོས་པར་གྱུར་ཏོ།
en: Anyone who suffered from disease was healed.

source: །མི་བདེ་བ་ཐམས་ཅད་ནི་བདེ་བ་ཐོབ་པར་གྱུར་ཏོ།
en: Anyone feeling discomfort attained happiness.

source: །འཇིགས་པས་ཉེན་པ་རྣམས་ནི་དབུགས་ཕྱིན་པ་ཐོབ་པར་གྱུར་ཏོ།
en: All who were struck with fear found release.

source: །བཅིང་བས་བཅིངས་པ་རྣམས་ནི་བཅིངས་པ་ལས་གྲོལ་བར་གྱུར་ཏོ།
en: Anyone living in bondage was freed from his or her ties.

source: །སེམས་ཅན་དབུལ་པོ་རྣམས་ནི་ལོངས་སྤྱོད་དང་ལྡན་པར་གྱུར་ཏོ།
en: Anyone suffering from poverty discovered wealth.

source: །ཉོན་མོངས་པས་གདུངས་པ་རྣམས་ནི་ཡོངས་སུ་གདུང་བ་མེད་པར་གྱུར་ཏོ།
en: All the people tormented by disturbing emotions found release from their anguish.

source: །བཀྲེས་པ་རྣམས་ནི་ལྟོ་འགྲངས་པར་གྱུར་ཏོ།
en: Those who were starving had their stomachs filled.

source: །སྐོམ་པ་རྣམས་ནི་སྐོམ་པ་མེད་པར་གྱུར་ཏོ།
en: All the ones who were parched were relieved of their thirst.

source: །སྦྲུམ་མ་རྣམས་ནི་བདེ་བར་བཙས་པར་གྱུར་ཏོ།
en: Pregnant women gave birth easily.

source: །ཞུམ་པ་ཉམ་ཆུང་བ་རྣམས་ནི་སྟོབས་ཕུན་སུམ་ཚོགས་པར་གྱུར་ཏོ།
en: Those who were old and weak gained perfect strength.

source: །དེའི་ཚེ་སེམས་ཅན་གང་ལ་ཡང་འདོད་ཆགས་དང་ཞེ་སྡང་དང་། གཏི་མུག་དང་། ཁྲོ་བ་དང་། ཆགས་པ་དང་། ཐ་བ་དང་། གནོད་སེམས་དང་། ཕྲག་དོག་གི་གནོད་པ་མེད་པར་གྱུར་ཏོ།
en: At that moment all sentient beings were relieved of the harms inflicted by attachment, anger, ignorance, wrath, greed, cruelty, ill will, envy, and jealousy.

source: །དེའི་ཚེ་སེམས་ཅན་གང་ཡང་འཆི་བ་མེད། འཕོ་བ་མེད། སྐྱེ་བ་མེད་དོ། །
en: At that moment no one experienced dying, moving to the next life, and taking birth.

source: དེའི་ཚེ་སེམས་ཅན་ཐམས་ཅད་བྱམས་པའི་སེམས་དང་། ཕན་པའི་སེམས་དང་ལྡན་ཞིང་གཅིག་ལ་གཅིག་ཕ་མར་འདུ་ཤེས་བསྐྱེད་པར་གྱུར་ཏོ།
en: At that moment everyone engendered love, altruism, and a feeling that all beings are each other’s mothers and fathers.

source: མནར་མེད་པ་ལ་ཐུག་པའི་བར། །དམྱལ་བ་མི་བཟད་སྣང་བ་ཡི།
en: All the way to the hell of Ultimate Torment, The hell beings presented a horrible sight.

source: །སེམས་ཅན་རྣམས་ཀྱི་སྡུག་བསྔལ་ཞི།
en: These beings had their suffering pacified

source: །བདེ་བའི་ཚོར་བ་ཐོབ་པར་འགྱུར།
en: And experienced feelings of happiness.

source: །དུད་འགྲོའི་སྐྱེ་གནས་སེམས་ཅན་རྣམས།
en: The beings born as animals,

source: །ཕན་ཚུན་གནོད་བྱེད་ཇི་སྙེད་པ།
en: Which harm each other in countless ways,

source: །ཐུབ་ཆེན་འོད་ཀྱིས་རེག་པས་ན།
en: Were touched by the light of the Lord,

source: །དེ་དག་བྱམས་པའི་སེམས་ཀྱང་སྐྱེས།
en: And, for their good, gave rise to a loving mind.

source: །ཡི་དགས་འཇིག་རྟེན་ཡི་དགས་རྣམས།
en: Spirits, as many as there are in the world,

source: །བཀྲེས་སྐོམ་ཉེན་པ་ཇི་སྙེད་པ།
en: Pained by hunger and thirst,

source: །བྱང་ཆུབ་སེམས་དཔའི་གཟི་བརྗིད་ཀྱིས། །དེ་དག་ཟས་སྐོམ་རྙེད་པར་གྱུར།
en: Discovered food and drink Through the power of the Bodhisattva.

source: །མི་ཁོམ་ཐམས་ཅད་ཆད་གྱུར་ཅིང་།
en: All unfortunate states came to a halt,

source: །ངན་འགྲོ་རྣམས་ཀྱང་སྐམས་པར་གྱུར།
en: And the lower realms dried out.

source: །སེམས་ཅན་ཐམས་ཅད་བདེར་གྱུར་ཏེ།
en: All beings gained happiness

source: །ལྷ་ཡི་བདེ་བས་རབ་ཏུ་ཚིམ།
en: And were fulfilled with divine pleasure.

source: །མིག་དང་རྣ་བ་མེད་པ་དང་། །གཞན་ཡང་གང་དག་དབང་པོ་ཉམས།
en: Those without eyes and ears, And all others with impaired faculties,

source: །དེ་དག་དབང་པོ་ཀུན་རྫོགས་ཤིང་།
en: Regained their full senses

source: །ཡན་ལག་ཐམས་ཅད་མཛེས་པར་གྱུར།
en: And obtained beautiful limbs.

source: །འདོད་ཆགས་ཞེ་སྡང་ལ་སོགས་པའི།
en: Attachment and anger

source: །ཉོན་མོངས་རྣམས་ཀྱིས་སེམས་ཅན་གང་།
en: And other disturbing emotions that harm beings—

source: །གནོད་གྱུར་དེ་ཚེ་ཉོན་མོངས་ཀུན།
en: In that moment all these disturbing emotions were pacified,

source: །ཞི་བར་གྱུར་ཏེ་བདེ་དང་ལྡན།
en: And beings were filled with happiness.

source: །སྨྱོས་པ་དག་ནི་དྲན་ལྡན་ཞིང་།
en: The ones who had lost their minds regained their composure;

source: །དབུལ་པོ་དག་ཀྱང་ནོར་དང་ལྡན།
en: Those living in poverty found wealth.

source: །ནད་ཀྱིས་བཏབ་པ་ནད་སོས་ཤིང་།
en: Those stricken with sickness were healed;

source: །བཅིང་བས་བཅིངས་པ་གྲོལ་བར་གྱུར།
en: Those who were bound were freed.

source: །སེར་སྣ་མེད་ཅིང་དགྲ་མེད་དེ།
en: There was no miserliness nor animosity,

source: །གནོད་སེམས་དང་ནི་རྩོད་པ་དག །ཕན་ཚུན་བྱེད་པ་མེད་གྱུར་ཏེ།
en: No ill will or strife. All beings interacted in harmony,

source: །དེ་ཚེ་བྱམས་པའི་སེམས་སུ་གནས།
en: Their minds full of loving kindness.

source: །ཕ་དང་མ་དག་བུ་གཅིག་ལ། །ཇི་ལྟར་ཕངས་པར་སེམས་པ་ལྟར།
en: Just as a father and mother Cherish their only child,

source: །དེ་བཞིན་སེམས་ཅན་ཕན་ཚུན་དུ།
en: At that moment all beings felt

source: །དེ་ཚེ་བུ་ཕངས་བཞིན་དུ་སེམས།
en: Parental love for each other.

source: །བྱང་ཆུབ་སེམས་དཔའི་འོད་དྲ་ཡིས།
en: The web of the Bodhisattva’s light rays

source: །ཕྱོགས་བཅུའི་ཕྱོགས་ནི་ཀུན་ཏུ་ཡང་། །གང་གཱའི་བྱེ་མའི་གྲངས་སྙེད་ཀྱི། །ཞིང་རྣམས་བསམ་གྱིས་མི་ཁྱབ་གསལ།
en: Streamed out all around in the ten directions And illuminated an inconceivable number of realms, As numerous as grains of sand in the Ganges.

source: །རི་བོ་ནག་པོ་རྣམས་དང་ནི།
en: The Black Mountains

source: །ཁོར་ཡུག་དག་ཀྱང་མི་སྣང་གྱུར།
en: And the surrounding perimeter walls disappeared.

source: །རྒྱ་ཆེན་ཞིང་རྣམས་དེ་དག་ཀུན།
en: All the vast worlds

source: །གཅིག་པོ་ཇི་བཞིན་དེ་ལྟར་སྣང་།
en: Now appeared as one.

source: །ལག་མཐིལ་ལྟ་བུར་གྱུར་པ་སྟེ།
en: They could be seen as clearly as the palm of a hand, Composed of all kinds of jewels.

source: །ཞིང་རྣམས་ཐམས་ཅད་ལེགས་བརྒྱན་པས། །ཐམས་ཅད་རིན་ཆེན་ཉིད་དུ་སྣང་།
en: All realms were well adorned.

source: །བྱང་ཆུབ་སྙིང་པོའི་རིམ་གྲོ་པ།
en: The attendants at the seat of awakening

source: །ལྷ་ནི་དེ་ལྟར་བཅུ་དྲུག་ཡོད།
en: Were a group of sixteen gods.

source: །དཔག་ཚད་བརྒྱད་ཅུའི་ས་ཁྱོན་ནང་།
en: Up to a distance of eighty leagues,

source: །བྱང་ཆུབ་སྙིང་པོ་བརྒྱན་པར་གྱུར།
en: They adorned the seat of awakening. All great displays

source: །ཞིང་རྣམས་བྱེ་བ་མཐའ་ཡས་ན།
en: In all the limitless millions of realms

source: །བཀོད་པ་ཆེན་པོ་གང་ཡོད་པ།
en: Now manifested at this place

source: །བྱང་ཆུབ་སེམས་དཔའི་གཟི་བརྗིད་ཀྱིས། །དེ་དག་ཐམས་ཅད་དེར་ཡང་སྣང་།
en: By the power of the Bodhisattva.

source: །ལྷ་དང་ཀླུ་དང་གནོད་སྦྱིན་དང་། །མིའམ་ཅི་དང་ལྟོ་འཕྱེ་ཆེ།
en: The gods, nāgas, yakṣas, Kinnaras, and mahoragas

source: །རང་རང་གཞལ་མེད་ཁང་རྣམས་ལ།
en: Now came to think of their celestial palaces

source: །དུར་ཁྲོད་ཙམ་དུ་ཤེས་པར་གྱུར།
en: As nothing more than charnel grounds.

source: །འདིར་ནི་བཀོད་པ་དེ་མཐོང་ནས། །ལྷ་དང་མི་རྣམས་ངོ་མཚར་གྱུར། །བསོད་ནམས་གང་གི་རྒྱུ་འཐུན་འདིར། །ཕུན་སུམ་འདི་འདྲ་འདི་ལེགས་འཚར།
en: When gods and humans witnessed this display, They were filled with amazement. “How great is this manifestation of merit, Which results in such an auspicious juncture!”

source: །ལུས་དང་ངག་དང་ཡིད་རྣམས་ཀྱིས། །བརྩོན་པར་བྱེད་པ་མེད་པར་ཡང་།
en: Without any effort, Whether physical, verbal, or mental,

source: །དེ་ཡི་ཡིད་ལ་འདོད་པ་དང་། །བསམ་པ་ཐམས་ཅད་རབ་ཏུ་འགྲུབ།
en: All the Bodhisattva’s goals, wishes, and intentions Were fully accomplished.

source: །ཇི་ལྟར་བསམ་པ་གཞན་དག་ཀྱང་།
en: Even the wishes of others were fulfilled

source: །སྔོན་སྤྱོད་ཚེ་ན་རྫོགས་གྱུར་པ།
en: Through his actions in the past.

source: །ལས་དེའི་རྣམ་པར་སྨིན་པ་ཡིས།
en: The ripening of those actions

source: །འདི་འདྲའི་ཕུན་སུམ་ཚོགས་འདི་བྱུང་།
en: Now produced such perfect results.

source: །བྱང་ཆུབ་ཤིང་གི་ལྷ་མོ་བཞིས།
en: The four deities at the seat of awakening

source: །ལྷ་ཡི་ཤིང་ནི་ཡོངས་འདུ་བ།
en: Adorned the seat of awakening

source: །དེ་བས་ཁྱད་པར་འཕགས་པ་ཡིས།
en: To make it even more supreme

source: །བྱང་ཆུབ་སྙིང་པོར་བརྒྱན་པར་བྱས།
en: Than the heavenly coral trees.

source: །བྱང་ཆུབ་སྙིང་པོའི་བཀོད་པ་གང་།
en: The displays at the seat of awakening

source: །ལྷ་ཡིས་མངོན་པར་འདུས་བྱས་པ།
en: Were created by these four deities.

source: །ཡོན་ཏན་དེ་དག་ཚིག་གིས་ནི།
en: To describe their qualities in words

source: །ཐམས་ཅད་བརྗོད་པར་ཡོང་མི་ནུས།
en: Would be utterly impossible.

source: །དགེ་སློང་དག་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ལུས་ལས་འོད་ཕྱུང་བ་རྣམ་པར་དག་པ།
en: Monks, the light that streamed from the body of the Bodhisattva illuminated the abode of Kālika, the king of nāgas.

source: དྲི་མ་མེད་པ། ལུས་དང་སེམས་ཚིམ་པར་བྱེད་ཅིང་དགའ་བསྐྱེད་པ།
en: The light was pure and stainless and gave rise to joy as it satisfied the bodies and minds that it touched.

source: ཉོན་མོངས་པ་ཐམས་ཅད་སེལ་བ། སེམས་ཅན་ལ་དགའ་བ་དང་། བདེ་བ་དང་། དད་པ་དང་། མཆོག་ཏུ་དགའ་བ་ཐམས་ཅད་སྐྱེད་པ་དེས་ཀླུའི་རྒྱལ་པོ་ནག་པོའི་གནས་སྣང་བར་བྱས་པར་མཐོང་ནས།
en: It cleared away all disturbing emotions and brought joy, happiness, trust, and supreme enjoyment to all sentient beings.

source: དེའི་ཚེ་ཀླུའི་རྒྱལ་པོ་ནག་པོ་རང་གི་འཁོར་གྱི་མདུན་དུ་འདུག་སྟེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །གང་ཕྱིར་བདག་གི་གནས་འདི་གསེར་གྱི་འོད་ཀྱིས་བརྒྱན་པར་ལྷ་དེར་གྱུར་པ་ལས།
en: When Kālika, the king of the nāgas, saw how the light illumined his own abode, he spoke these verses in front of his retinue:

source: །ཇི་ལྟར་འཁོར་བ་འཇིག་གི་འོད་མཛེས་མཐོང་ཞིང་གསེར་ཞེས་བྱ་བ་མཐོང་བ་དང་། །ཇི་ལྟར་འོད་སྲུང་ཆོས་ཀྱི་རྒྱལ་པོ་སྐྱོན་མེད་པ་ཡི་དྲི་མེད་འོད་མཐོང་ལྟར།
en: “I see a light like that of Krakucchanda, or the brightness of Kanakamuni; It is like seeing the stainless and faultless light of Kāśyapa, the Dharma king.

source: །མཚན་མཆོག་ལྡན་ཞིང་ཕན་མཛད་ཡེ་ཤེས་འོད་ལྡན་པ་ཞིག་འབྱུང་དུ་ཐེ་ཚོམ་མེད།
en: Surely a being with supreme features, helpful activity, and wisdom light is here;

source: །སྔོན་ཆད་ཉེས་པར་བྱས་པའི་ལས་ཀྱིས་བདག་གི་ཁྱིམ་ནི་ཤིན་ཏུ་མུན་པས་གང་།
en: That is why this abode of mine is bright and adorned with this golden light. “Up to now, our isolated home has been filled with darkness as a result of our previous negative actions;

source: །ཁྱིམ་འདི་ན་ནི་ཉི་མ་ཟླ་བ་དག་གིས་རྒྱ་ཆེར་འོད་ཀྱང་ཡོང་མི་སྣང་།
en: Even the far-reaching rays of the sun and moon do not penetrate this place.

source: །མེ་དང་ནོར་བུ་དག་དང་དྲི་མེད་གློག་དང་སྐར་མ་རྣམས་ཀྱི་འོད་མི་སྣང་།
en: The pure light from fire, jewels, lightning, and the stars also do not penetrate this place;

source: །བརྒྱ་བྱིན་འོད་དང་ཚངས་པའི་འོད་དང་ལྷ་མིན་རྣམས་ཀྱི་འོད་ཀྱང་མི་སྣང་ན།
en: Neither do the light rays of Indra, Brahmā, or the demigods shine through.

source: །དེ་རིང་ཁྱིམ་འདིའི་ནང་དུ་ཉི་མའི་འོད་འདྲ་བ་ཡི་དགེ་བས་མཛེས་གྱུར་ལ།
en: “Yet today this house is bright with a beauty that resembles the sun;

source: །སེམས་ཀྱང་དགའ་བསྐྱེད་ཅིང་ལུས་ཀྱང་བདེ་བར་གྱུར་ལ་ལུས་ནི་བསིལ་གྱུར་ཏེ།
en: Our minds are filled with joy, and our bodies feel at ease and soothed.

source: །ལུས་ཀྱི་སྟེང་དུ་བྱེ་ཚན་འབབ་པ་དེ་ཡང་བདག་ལ་བསིལ་བར་གྱུར་པ་ལས།
en: Even the rain of warm sand falling on my body feels cool.

source: །བསྐལ་པ་བྱེ་བ་མང་པོར་སྤྱད་པ་བྱང་ཆུབ་ཤིང་དྲུང་བཞུད་པར་ཤིན་ཏུ་གསལ།
en: It is clear that the One Who Practiced Good Conduct for Many Millions of Eons is walking toward the Bodhi tree.

source: །ཀླུ་ཡི་མེ་ཏོག་མཛེས་དང་བཟང་ལ་དྲི་ཞིམ་གོས་དང་མུ་ཏིག་དོ་ཤལ་དང་། །རྒྱན་དང་གདུ་བུ་དག་དང་ཕྱེ་མ་རྣམས་དང་བདུག་པ་མཆོག་རྣམས་མྱུར་ཐོགས་ལ།
en: “Quick, go get beautiful nāga flowers, fine and sweet-smelling cloths, pearl necklaces, Ornaments and bracelets, powders, and our finest incense.

source: །གླུ་དབྱངས་དག་དང་རོལ་མོའི་དབྱངས་སྒྲ་སྣ་ཚོགས་གྱིས་ཤིག་རྔ་དང་རྫ་རྔ་བཟང་།
en: Offer him the melodious sounds of song and music, and beat the finest drums. Go now!

source: །བརྡུང་ཞིང་འགྲོ་བླ་ཀུན་གྱིས་མཆོད་འོས་ཕན་པ་མཛད་ལ་མཆོད་པ་བྱེད་དུ་འདེང་།
en: Make offerings to the benefactor who is worthy of everyone’s respect.”

source: །དེ་ནི་ལངས་ཏེ་ཀླུ་ཡི་བུ་མོ་རྣམས་དང་ལྷན་ཅིག་ཕྱོགས་བཞིར་བལྟས་པ་དང་། །དེ་ནས་རི་བོ་ལྷུན་པོ་ལྟ་བུར་གཟི་བརྗིད་རྣམས་ཀྱིས་ལེགས་པར་བརྒྱན་པ་ཞིག །ལྷ་དང་ལྷ་མིན་བྱེ་བ་དག་དང་ཚངས་པའི་དབང་དང་གནོད་སྦྱིན་རྣམས་ཀྱིས་བསྐོར།
en: Kālika then stood up and, with the nāga daughters, looked in the four directions. He saw the Bodhisattva, shining with splendor like the central mountain. He was surrounded by millions of gods, demigods, Brahmā, Indra, and the yakṣas;

source: །དགའ་བའི་ཡིད་ཀྱིས་དེ་ལ་མཆོད་བྱེད་ཤུལ་ནི་འདི་ཞེས་སྟོན་ཅིང་འདོང་བ་མཐོང་།
en: Joyfully they venerated him and showed him the way.

source: །ཀླུ་ཡི་རྒྱལ་དེ་རབ་ཏུ་དགའ་ཞིང་མགུ་ནས་འཇིག་རྟེན་མཆོག་ལ་མཆོད་བྱས་ཏེ།
en: The king of the nāgas became overjoyed and respectfully made offerings to the Supreme One in the world;

source: །གུས་དང་བཅས་པས་དེ་ཡི་རྐང་པ་གཉིས་ལ་ཕྱག་འཚལ་ཐུབ་པའི་མདུན་དུ་འདུག །ཀླུ་ཡི་བུ་མོ་རྣམས་ཀྱང་དགའ་ཞིང་མགུ་བའི་ཡིད་ཀྱིས་ཐུབ་ལ་མཆོད་པ་བྱེད།
en: With devotion he prostrated at the Sage’s feet and stood in front of him. The nāga daughters also joyfully and respectfully venerated the Sage;

source: །མེ་ཏོག་རྣམས་དང་སྤོས་དང་བྱུག་པ་དག་ཀྱང་འཐོར་ཞིང་སིལ་སྙན་རྣམས་ཀྱང་བྱེད།
en: They scattered flowers, incense, and perfumes, and played music.

source: །ཀླུ་ཡི་རྒྱལ་པོ་རབ་ཏུ་དགའ་ནས་ཐལ་སྦྱར་ཡང་དག་ཡོན་ཏན་རྣམས་ཀྱིས་བསྟོད།
en: Overjoyed with the Lord’s perfect qualities, the king of the nāgas joined his palms.

source: །འདྲེན་པ་འཇིག་རྟེན་དམ་པ་དགུང་ཟླ་ཉ་བའི་ཞལ་འདྲ་མཐོང་བར་གྱུར་པ་ལེགས།
en: “Guide! The best in the world! Wonderful to see your face, like the full moon!

source: །བདག་གིས་སྔོན་ཆད་དྲང་སྲོང་རྣམས་ཀྱི་མཚན་མ་མཐོང་བ་ཁྱོད་ཀྱང་དེ་འདྲ་སྟེ།
en: As I saw the omens foretelling the previous sages, I see the very same signs in you.

source: །དེ་རིང་ཁྱོད་ཀྱིས་བདུད་ཀྱི་དཔུང་རྣམས་བཅོམ་སྟེ་བཞེད་པའི་གོ་འཕང་བརྙེས་པར་འགྱུར།
en: Today you will conquer Māra’s army and attain your desired state.

source: །གང་གི་དོན་དུ་སྔན་ཆད་དུལ་དང་སྦྱིན་དང་བསྡམས་ཤིང་བདོག་པ་ཀུན་བཏང་ལ།
en: “This is why in the past you practiced discipline, generosity, and restraint, and gave up all possessions;

source: །གང་གི་དོན་དུ་དུལ་དང་ཚུལ་ཁྲིམས་བྱམས་དང་སྙིང་རྗེ་བ་དང་བཟོད་པ་བསྒོམས།
en: This is why you cultivated discipline, ethical conduct, love, compassion, and the power of forbearance.

source: །གང་གི་དོན་དུ་བརྩོན་འགྲུས་བརྟན་དང་བསམ་གཏན་དགྱེས་དང་ཤེས་རབ་འབར་མཛད་པ།
en: This is why you were diligent, steadfast, delighting in concentration, and letting your insight blaze;

source: །ཁྱོད་ཀྱི་སྨོན་ལམ་དེ་དག་ཐམས་ཅད་རབ་ཏུ་རྫོགས་ནས་དེ་རིང་རྒྱལ་བར་འགྱུར།
en: Today all your aspirations will be fulfilled and you shall become victorious.

source: །ཇི་ལྟར་ལྗོན་ཤིང་ལོ་མ་མེ་ཏོག་འབྲས་བུར་བཅས་པ་བྱང་ཆུབ་ཤིང་ལ་འདུད།
en: “Since other trees with their leaves, flowers, and fruits bow to the Bodhi tree,

source: །ཇི་ལྟར་བུམ་པ་ཆབ་ཀྱིས་གང་བ་སྟོང་དག་ཁྱོད་ལ་བསྐོར་བ་རབ་བགྱིད་ཅིང་།
en: Since a thousand vases filled with water circumambulate you,

source: །ཇི་ལྟར་ཙ་ཤའི་ཚོགས་རྣམས་རབ་ཏུ་དགའ་སྟེ་སྙན་པའི་སྒྲ་སྐད་འབྱིན་པ་དང་། །ཇི་ལྟར་ངང་པ་ཁྲུང་ཁྲུང་ཚོགས་ཀྱང་མཁའ་ལ་མཆི་ཞིང་ཚུལ་དུ་ཤིས་ལྡན་པར།
en: Since hosts of cāṣa birds, overjoyed, make affectionate sounds, Since flocks of swans and cranes playfully take to the sky

source: །དང་བའི་ཡིད་ཀྱིས་དྲང་སྲོང་ལ་ནི་བསྐོར་བ་བགྱིད་ལས་དེ་རིང་དགྲ་བཅོམ་འགྱུར།
en: And joyfully circle clockwise above the Sage, today you will become a worthy one.

source: །ཇི་ལྟར་གསེར་གྱི་ཁ་དོག་ལྟ་བུར་མཛེས་པའི་འོད་རྣམས་ཞིང་ནི་བརྒྱར་མཆིས་ཏེ།
en: “Since hundreds of buddha realms are filled with beautiful golden light,

source: །ཇི་ལྟར་ངན་སོང་མཐའ་དག་ཞི་བར་བགྱིད་ཅིང་སྐྱེ་དགུའི་སྡུག་བསྔལ་ཐར་བགྱིད་དང་། །ཇི་ལྟར་ཉི་མ་ཟླ་བའི་གནས་ཀྱི་རྒྱུན་ཚད་བསེར་མའང་དལ་བུས་ལྡང་བ་ལས།
en: Since the lower realms in their entirety come to a halt and the suffering of beings ceases, Since showers fall in the abodes of the sun and the moon, and a soft breeze blows,

source: །སྲིད་པ་གསུམ་དུ་སྐྱེ་དང་རྒ་བ་ཐར་མཛད་པ་ཡི་དེད་དཔོན་དེ་རིང་འགྱུར།
en: Today you will become a leader who delivers beings from birth and old age in the three realms.

source: །ཇི་ལྟར་ལྷ་རྣམས་འདོད་པའི་དགའ་བ་སྤངས་ཏེ་ཁྱོད་ལ་མཆོད་དུ་ལྷགས་པ་དང་། །ཚངས་དང་ཚངས་པའི་མདུན་ན་འདོན་དང་ལྷ་རྣམས་བསམ་གཏན་བདེ་བ་སྤངས་པ་དང་། །གང་ཡང་སྲིད་པ་གསུམ་ན་དབང་ཕྱུག་དམ་པ་མཆིས་པ་ཐམས་ཅད་འདིར་ལྷགས་ལས།
en: “Since the gods give up their delight in pleasure and come to venerate you, Since Brahmā and the gods of the Brahmapurohita class abandon the bliss of concentration, And likewise all the others in the three realms arrive here,

source: །སྲིད་པ་གསུམ་དུ་སྐྱེ་རྒ་ཐར་བ་མཛད་པའི་སྨན་པའི་རྒྱལ་པོ་དེ་རིང་བྱོན།
en: Today you will become the king of physicians who delivers beings from birth and old age in the three realms.

source: །ཇི་ལྟར་ལྷ་རྣམས་དག་གིས་ཕྱག་དར་བགྱིས་པའི་ཤུལ་དེ་ནས་ནི་ཁྱོད་གཤེགས་ལ།
en: “Since the path that you walk on today has been swept by the gods,

source: །བཅོམ་ལྡན་འཁོར་བ་འཇིག་དང་གསེར་ཞེས་བགྱི་དང་འོད་སྲུང་དག་ཀྱང་དེ་ནས་གཤེགས།
en: A path that the lords Krakucchanda, Kanakamuni, and Kāśyapa also traversed,

source: །ཇི་ལྟར་པད་མ་བཟང་པོ་དྲི་མ་མ་མཆིས་རྣམ་དག་དོག་ས་བརྟོལ་བྱུང་སྟེ།
en: Since in your footsteps stainless and perfect lotuses spring forth, breaking out of the earth,

source: །དེ་ལ་སྟོབས་ཆེན་ལྡན་པ་ཞབས་ཀྱི་གོམ་པ་འདོར་ལས་དེ་རིང་དགྲ་བཅོམ་འགྱུར།
en: Onto which you tread with powerful steps, today you will become a worthy one.

source: །བྱེ་བ་ཁྲག་ཁྲིག་སྟོང་ཕྲག་དུ་མའི་གང་གཱ་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་བདུད།
en: “Trillions of demons, as many as there are grains of sand in the Ganges,

source: །དེ་དག་རྣམས་ཀྱིས་བྱང་ཆུབ་ཤིང་དྲུང་ནས་ནི་ཁྱོད་ལ་བསྐྱོད་པའམ་གཡོས་མ་ནུས།
en: Are unable to move you from under the branches of the Bodhi tree, or to shake you.

source: །མཆོད་སྦྱིན་ཁྲག་ཁྲིག་ཕྲག་སྟོང་རྣམ་པ་དུ་མ་གང་གཱ་ཀླུང་གི་བྱེ་མ་སྙེད།
en: You have made billions of offerings, as many as there are grains of sand in the Ganges,

source: །ཁྱོད་ཀྱིས་མཛད་ཅིང་འགྲོ་ལ་ཕན་ཕྱིར་སྤྱད་པ་དེས་ན་འདིར་ནི་རྣམ་པར་མཛེས།
en: Always acting for the benefit of the world—this is why you shine here today.

source: །རྒྱུ་སྐར་ཟླ་བར་བཅས་ཤིང་སྐར་མ་ཉི་མར་བཅས་པ་མཁའ་ལས་སར་ལྟུང་གདའ།
en: “The planets, the moon, the stars, and the sun may fall from the sky to the ground,

source: །རི་མཆོག་ཆེན་པོ་རང་གི་གནས་ནས་གཡོ་ཞིང་རྒྱ་མཚོ་སྐམས་པར་འགྱུར་ཡང་གདའ།
en: The mightiest mountains may move from their places, and oceans may dry up,

source: །སྐྱེས་བུ་མཁས་པ་ལ་ལས་ཁམས་བཞི་པོ་དག་རེ་རེ་ནས་ནི་སྟོན་ནུས་གདའ།
en: Some learned person might magically display each of the four elements,

source: །ཁྱོད་ནི་ཤིང་གི་རྒྱལ་པོའི་དྲུང་དུ་གཤེགས་ནས་བྱང་ཆུབ་མ་ཐོབ་བཞེངས་མི་གདའ།
en: Yet it is impossible that you would go to the king of trees and rise before attaining awakening.

source: །གང་གི་སླད་དུ་ཁ་ལོ་སྒྱུར་བ་མཐོང་ཞིང་མཆོད་བགྱིས་ཡོན་ཏན་བརྗོད་པ་དང་། །བྱང་ཆུབ་ཏུ་ཡང་སྤྲོ་བས་བདག་གིས་རྙེད་པ་འཕེལ་བ་རྒྱ་ཆེན་རྙེད་པར་གྱུར།
en: “Guide, in seeing you I have fortuitously obtained great prosperity; I have made offerings to you, spoken of your qualities, and strived for awakening.

source: །བུར་བཅས་བདག་དང་ཀླུ་ཡི་བུ་མོ་ཐམས་ཅད་སྐྱེ་གནས་འདི་ལས་ཐར་གྱུར་ཅིང་།
en: May I and all my nāga wives and children become free from this existence.

source: །གླང་པོ་དྲེགས་པའི་སྟབས་སུ་བཞུད་པ་ཁྱོད་ཀྱི་སྟབས་དེས་བདག་ཅག་མཆི་བར་བགྱི།
en: Your gait is like the walk of an elephant in rut—may we walk like you!”

source: །དགེ་སློང་དག་དེ་ལྟར་ཀླུའི་རྒྱལ་པོ་ནག་པོའི་ཆུང་མ་དམ་པ་གསེར་འོད་ཅེས་བྱ་བ་ཀླུའི་བུ་མོ་རིན་པོ་ཆེའི་གདུགས་སྣ་ཚོགས་ཐོགས་པ་དང་། སིལ་སྙན་སྣ་ཚོགས་ཐོགས་པ་དང་། མུ་ཏིག་གི་དོ་ཤལ་སྣ་ཚོགས་ཐོགས་པ་དང་། ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཐོགས་པ་དང་། ལྷའི་དང་མིའི་ཕྲེང་བ་བརྒྱུས་པ་སྣ་ཚོགས་ཐོགས་པ་དང་། པོག་ཕོར་སྣ་ཚོགས་ཐོགས་པ་དང་། སིལ་སྙན་དང་གླུ་དབྱངས་སྣ་ཚོགས་ལེན་པ་རབ་ཏུ་མང་པོས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ།
en: Monks, at this point Suvarṇa­prabhāsā, the chief queen of Kālika the nāga king, came to see the Bodhisattva. She was surrounded and escorted by many nāga girls, who were holding various types of cloth, parasols made of assorted jewels, different pearl necklaces, a variety of precious jewels, an array of garlands, a myriad of unguents and powders made by gods and humans, and containers with diverse perfumes. The nāga girls attended to the Bodhisattva while they sang melodious songs accompanied by music.

source: བྱང་ཆུབ་སེམས་དཔའི་གན་དུ་འདོང་ཞིང་རིན་པོ་ཆེའི་མེ་ཏོག་སྣ་ཚོགས་མངོན་པར་གཏོར་ཏེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་ཀྱང་བསྟོད་དོ།
en: In this way, as the Bodhisattva proceeded on his way, they besprinkled him with showers of flowers made of various jewels and praised him with these verses:

source: །འཁྲུལ་པ་མི་མངའ་མི་བསྙེངས་མི་འཛེམ་བག་མི་ཚ།
en: “You are unerring, fearless, confident, and brave;

source: །མ་ཞུམ་མི་དམན་རབ་ཏུ་དགྱེས་པར་གདུལ་དཀའ་བ།
en: You are not depressed, but intrepid, joyous, and hard to dominate.

source: །མ་ཆགས་མི་སྡང་མ་རྨོངས་བརྐམ་པ་མི་མངའ་བ།
en: You are not attached, not angry, not deluded, and without desire;

source: །ཆགས་བྲལ་རྣམ་གྲོལ་དྲང་སྲོང་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ།
en: You are dispassionate and liberated. Homage to you, O Great Sage!

source: །སྨན་པ་ཟུག་རྔུ་བྲལ་བ་གདུལ་བ་འདུལ་མཛད་པ།
en: “You are a physician who removes pain, and a guide for those who need guidance;

source: །འགྲོ་བ་སྡུག་བསྔལ་རྣམས་ལས་ཐར་མཛད་སྨན་པ་མཆོག །གནས་དང་སྐྱབས་མ་མཆིས་ཤིང་དམན་པ་མཁྱེན་ནས་ནི།
en: You are the supreme physician who liberates beings from suffering. Considering those without refuge or protection,

source: །འཇིག་རྟེན་གསུམ་འདིར་གནས་དང་སྐྱབས་སུ་ཁྱོད་བྱུང་ངོ་།
en: You have manifested as a home and a refuge in this threefold world.

source: །ཇི་ལྟར་ལྷ་ཚོགས་རབ་ཏུ་དད་ཅིང་དགར་གྱུར་ཏེ།
en: “Since the congregation of gods is pleased and joyful,

source: །མེ་ཏོག་ཆར་པ་ཆེན་པོ་མཁའ་ལས་འབེབས་པ་དང་། །འདི་དག་ཇི་ལྟར་གོས་ཆེན་འཐོར་བར་བགྱིད་པ་ལས།
en: They cause a great rain of flowers to fall from the sky. Since they toss down plenty of the finest cloth,

source: །དེ་རིང་རྒྱལ་བར་འགྱུར་གྱིས་རབ་ཏུ་དགྱེས་པར་མཛོད།
en: You will become victorious today. So be joyful!

source: །ཤིང་དབང་དྲུང་དུ་གཤེགས་ལ་བསྙེངས་པ་མི་མངར་བཞུགས།
en: “Approach the lord of trees and sit there without fear!

source: །བདུད་ཀྱི་སྡེ་ལས་རྒྱལ་མཛོད་ཉོན་མོངས་དྲ་བ་དྲོལ།
en: Conquer Māra’s army and become free from the web of disturbing emotions!

source: །སྔོན་གྱི་རྒྱལ་དབང་རྣམས་ཀྱིས་ཇི་ལྟར་སངས་རྒྱས་ལྟར།
en: Just as the victorious lords of the past attained awakening,

source: །བྱང་ཆུབ་ཞི་བ་དམ་པ་མཆོག་ཏུ་འཚང་རྒྱར་མཛོད།
en: So you will also attain supreme, sacred, and peaceful awakening!

source: །ཁྱོད་ཀྱིས་གང་གི་དོན་དུ་བསྐལ་པ་བྱེ་མང་དུ།
en: “For many millions of eons you have aimed for this;

source: །འགྲོ་བ་སྒྲོལ་བའི་དོན་དུ་དཀའ་བ་སྤྱད་པ་མཛད།
en: For the sake of liberating beings you have gone through hardship.
